## Janata Hack

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
df_train = pd.read_csv('train.csv')
df_test = pd.read_csv('test.csv')
sample_submission = pd.read_csv('sample_submission.csv')

In [3]:
df_test.head()

,ID,Gender,Ever_Married,Age,Graduated,Profession,Work_Experience,Spending_Score,Family_Size,Var_1
0,458989,Female,Yes,36,Yes,Engineer,0.0,Low,1.0,Cat_6
1,458994,Male,Yes,37,Yes,Healthcare,8.0,Average,4.0,Cat_6
2,458996,Female,Yes,69,No,NaN,0.0,Low,1.0,Cat_6
3,459000,Male,Yes,59,No,Executive,11.0,High,2.0,Cat_6
4,459001,Female,No,19,No,Marketing,NaN,Low,4.0,Cat_6

In [4]:
df_train.head()

,ID,Gender,Ever_Married,Age,Graduated,Profession,Work_Experience,Spending_Score,Family_Size,Var_1,Segmentation
0,462809,Male,No,22,No,Healthcare,1.0,Low,4.0,Cat_4,D
1,462643,Female,Yes,38,Yes,Engineer,NaN,Average,3.0,Cat_4,A
2,466315,Female,Yes,67,Yes,Engineer,1.0,Low,1.0,Cat_6,B
3,461735,Male,Yes,67,Yes,Lawyer,0.0,High,2.0,Cat_6,B
4,462669,Female,Yes,40,Yes,Entertainment,NaN,High,6.0,Cat_6,A

In [5]:
df_train.shape

(8068, 11)

In [6]:
df_test.shape

(2627, 10)

In [7]:
df_test.isna().sum()

ID                   0
Gender               0
Ever_Married        50
Age                  0
Graduated           24
Profession          38
Work_Experience    269
Spending_Score       0
Family_Size        113
Var_1               32
dtype: int64

In [8]:
df_train.isna().sum()

ID                   0
Gender               0
Ever_Married       140
Age                  0
Graduated           78
Profession         124
Work_Experience    829
Spending_Score       0
Family_Size        335
Var_1               76
Segmentation         0
dtype: int64

In [9]:
df_test['Work_Experience'] = df_test['Work_Experience'].fillna(-1)
df_test['Family_Size'] = df_test['Family_Size'].fillna(-1)
df_train['Work_Experience'] = df_train['Work_Experience'].fillna(-1)
df_train['Family_Size'] = df_train['Family_Size'].fillna(-1)

In [10]:
df_test['Ever_Married'] = df_test['Ever_Married'].fillna('null')
df_test['Graduated'] = df_test['Graduated'].fillna('null')
df_test['Profession'] = df_test['Profession'].fillna('null')
df_test['Var_1'] = df_test['Var_1'].fillna('null')
df_train['Ever_Married'] = df_train['Ever_Married'].fillna('null')
df_train['Graduated'] = df_train['Graduated'].fillna('null')
df_train['Profession'] = df_train['Profession'].fillna('null')
df_train['Var_1'] = df_train['Var_1'].fillna('null')

In [11]:
df_test.isna().sum()

ID                 0
Gender             0
Ever_Married       0
Age                0
Graduated          0
Profession         0
Work_Experience    0
Spending_Score     0
Family_Size        0
Var_1              0
dtype: int64

In [12]:
df_train.isna().sum()

ID                 0
Gender             0
Ever_Married       0
Age                0
Graduated          0
Profession         0
Work_Experience    0
Spending_Score     0
Family_Size        0
Var_1              0
Segmentation       0
dtype: int64

In [13]:
df_train.shape

(8068, 11)

In [14]:
df_test.shape

(2627, 10)

In [15]:
df_test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2627 entries, 0 to 2626
Data columns (total 10 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   ID               2627 non-null   int64
 1   Gender           2627 non-null   object
 2   Ever_Married     2627 non-null   object
 3   Age              2627 non-null   int64
 4   Graduated        2627 non-null   object
 5   Profession       2627 non-null   object
 6   Work_Experience  2627 non-null   float64
 7   Spending_Score   2627 non-null   object
 8   Family_Size      2627 non-null   float64
 9   Var_1            2627 non-null   object
dtypes: float64(2), int64(2), object(6)
memory usage: 205.4+ KB

In [16]:
df_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8068 entries, 0 to 8067
Data columns (total 11 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   ID               8068 non-null   int64
 1   Gender           8068 non-null   object
 2   Ever_Married     8068 non-null   object
 3   Age              8068 non-null   int64
 4   Graduated        8068 non-null   object
 5   Profession       8068 non-null   object
 6   Work_Experience  8068 non-null   float64
 7   Spending_Score   8068 non-null   object
 8   Family_Size      8068 non-null   float64
 9   Var_1            8068 non-null   object
 10  Segmentation     8068 non-null   object
dtypes: float64(2), int64(2), object(7)
memory usage: 693.5+ KB

In [17]:
df_test.head()

,ID,Gender,Ever_Married,Age,Graduated,Profession,Work_Experience,Spending_Score,Family_Size,Var_1
0,458989,Female,Yes,36,Yes,Engineer,0.0,Low,1.0,Cat_6
1,458994,Male,Yes,37,Yes,Healthcare,8.0,Average,4.0,Cat_6
2,458996,Female,Yes,69,No,null,0.0,Low,1.0,Cat_6
3,459000,Male,Yes,59,No,Executive,11.0,High,2.0,Cat_6
4,459001,Female,No,19,No,Marketing,-1.0,Low,4.0,Cat_6

In [18]:
df_train.head()

,ID,Gender,Ever_Married,Age,Graduated,Profession,Work_Experience,Spending_Score,Family_Size,Var_1,Segmentation
0,462809,Male,No,22,No,Healthcare,1.0,Low,4.0,Cat_4,D
1,462643,Female,Yes,38,Yes,Engineer,-1.0,Average,3.0,Cat_4,A
2,466315,Female,Yes,67,Yes,Engineer,1.0,Low,1.0,Cat_6,B
3,461735,Male,Yes,67,Yes,Lawyer,0.0,High,2.0,Cat_6,B
4,462669,Female,Yes,40,Yes,Entertainment,-1.0,High,6.0,Cat_6,A

In [19]:
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()
df_test['Gender'] = le.fit_transform(df_test['Gender'])
df_test['Ever_Married'] = le.fit_transform(df_test['Ever_Married'])
df_test['Graduated'] = le.fit_transform(df_test['Graduated'])
df_test['Profession'] = le.fit_transform(df_test['Profession'])
df_test['Spending_Score'] = le.fit_transform(df_test['Spending_Score'])
df_test['Var_1'] = le.fit_transform(df_test['Var_1'])

In [20]:
df_train['Gender'] = le.fit_transform(df_train['Gender'])
df_train['Ever_Married'] = le.fit_transform(df_train['Ever_Married'])
df_train['Graduated'] = le.fit_transform(df_train['Graduated'])
df_train['Profession'] = le.fit_transform(df_train['Profession'])
df_train['Spending_Score'] = le.fit_transform(df_train['Spending_Score'])
df_train['Var_1'] = le.fit_transform(df_train['Var_1'])

In [21]:
df_test.head()

,ID,Gender,Ever_Married,Age,Graduated,Profession,Work_Experience,Spending_Score,Family_Size,Var_1
0,458989,0,1,36,1,2,0.0,2,1.0,5
1,458994,1,1,37,1,5,8.0,0,4.0,5
2,458996,0,1,69,0,9,0.0,2,1.0,5
3,459000,1,1,59,0,4,11.0,1,2.0,5
4,459001,0,0,19,0,8,-1.0,2,4.0,5

In [22]:
df_train.head()

,ID,Gender,Ever_Married,Age,Graduated,Profession,Work_Experience,Spending_Score,Family_Size,Var_1,Segmentation
0,462809,1,0,22,0,5,1.0,2,4.0,3,D
1,462643,0,1,38,1,2,-1.0,0,3.0,3,A
2,466315,0,1,67,1,2,1.0,2,1.0,5,B
3,461735,1,1,67,1,7,0.0,1,2.0,5,B
4,462669,0,1,40,1,3,-1.0,1,6.0,5,A

In [23]:
x= df_train.drop(['Segmentation'],axis=1)
y= df_train['Segmentation']

In [24]:
x.head()

,ID,Gender,Ever_Married,Age,Graduated,Profession,Work_Experience,Spending_Score,Family_Size,Var_1
0,462809,1,0,22,0,5,1.0,2,4.0,3
1,462643,0,1,38,1,2,-1.0,0,3.0,3
2,466315,0,1,67,1,2,1.0,2,1.0,5
3,461735,1,1,67,1,7,0.0,1,2.0,5
4,462669,0,1,40,1,3,-1.0,1,6.0,5

In [25]:
y.head()

0    D
1    A
2    B
3    B
4    A
Name: Segmentation, dtype: object

## Logistic Regression

In [26]:
from sklearn.linear_model import LogisticRegression
lr = LogisticRegression()
lr.fit(x,y)
prediction1 = lr.predict(df_test)

In [27]:
prediction1

array(['D', 'D', 'D', ..., 'D', 'D', 'D'], dtype=object)

In [28]:
sample_submission.head()

       ID Segmentation
0  458989            A
1  458994            A
2  458996            A
3  459000            A
4  459001            A

In [29]:
submission = pd.DataFrame()
submission['ID'] = df_test['ID']
submission['Segmentation'] = prediction1

In [30]:
submission.to_csv('Submission1.csv', index=False)

## Decision Tree

In [31]:
from sklearn.tree import DecisionTreeClassifier

In [32]:
dft_model = DecisionTreeClassifier()
dft_model.fit(x,y)
prediction2 = dft_model.predict(df_test)

In [33]:
prediction2

array(['A', 'C', 'D', ..., 'B', 'C', 'D'], dtype=object)

In [34]:
submission['Segmentation'] = prediction2
submission.to_csv('Submission2.csv', index=False)

## Random Forest

In [35]:
from sklearn.ensemble import RandomForestClassifier

In [36]:
rft_model = RandomForestClassifier()
rft_model.fit(x,y)
prediction3 = rft_model.predict(df_test)

In [37]:
prediction3

array(['B', 'C', 'A', ..., 'D', 'B', 'D'], dtype=object)

In [38]:
submission['Segmentation'] = prediction3
submission.to_csv('Submission3.csv', index=False)

## KNN

In [39]:
from sklearn.neighbors import KNeighborsClassifier

In [40]:
classifier = KNeighborsClassifier(n_neighbors = 1,metric = 'minkowski',p = 2)
classifier.fit(x,y)
prediction4 = classifier.predict(df_test)

In [41]:
prediction4

array(['B', 'C', 'A', ..., 'B', 'B', 'A'], dtype=object)

In [42]:
submission['Segmentation'] = prediction4
submission.to_csv('Submission4.csv', index=False)

## SVM

In [43]:
from sklearn.svm import SVC

In [44]:
classifier = SVC(kernel = 'rbf',random_state = 1)
classifier.fit(x,y)
prediction5 = classifier.predict(df_test)

In [45]:
prediction5

array(['D', 'D', 'D', ..., 'D', 'D', 'D'], dtype=object)

In [46]:
submission['Segmentation'] = prediction5
submission.to_csv('Submission5.csv', index=False)